testing_filters.txt
***************** properties *****************
"insertproportion"="0"
"fieldlength"="10"
"scanlengthdistribution"="uniform"
"readproportion"="0"
"scanproportion"="0"
"columnfamily"="testing"
"maxscanlength"="100"
"readallfields"="true"
"dotransactions"="true"
"workload"="com.yahoo.ycsb.workloads.CoreWorkload"
"requestdistribution"="zipfian"
"recordcount"="1000"
"filterproportion"="1"
"updateproportion"="0"
"operationcount"="1"
"db"="com.yahoo.ycsb.BasicDB"
**********************************************
FILTER usertable user8627391162697748212 0[]
[OVERALL], RunTime(ms), 16.0
[OVERALL], Throughput(ops/sec), 62.5
[TOTAL_GCS_PS_Scavenge], Count, 0.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0.0
[TOTAL_GC_TIME], Time(ms), 0.0
[TOTAL_GC_TIME_%], Time(%), 0.0
[FILTER], Operations, 1.0
[FILTER], AverageLatency(us), 835.0
[FILTER], MinLatency(us), 835.0
[FILTER], MaxLatency(us), 835.0
[FILTER], 95thPercentileLatency(us), 835.0
[FILTER], 99thPercentileLatency(us), 835.0
[FILTER], Return=OK, 1
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2.0
[CLEANUP], MinLatency(us), 2.0
[CLEANUP], MaxLatency(us), 2.0
[CLEANUP], 95thPercentileLatency(us), 2.0
[CLEANUP], 99thPercentileLatency(us), 2.0